const ukCity = ["Алупка", "Алл", "Алушта", "Армянск", "Бахчисарай", "Белогорск", "Джанкой", "Евпатория", "Керчь", "Красноперекопск", "Саки", "Севастополь", "Симферополь", "Старый Крым", "Судак", "Феодосия", "Щёлкино", "Ялта", "Бар", "Бершадь", "Винница", "Гайсин", "Жмеринка", "Казатин", "Калиновка", "Ладыжин", "Могилёв-Подольский", "Немиров", "Погребище", "Тульчин", "Хмельник", "Шаргород", "Ямполь", "Берестечко", "Владимир-Волынский", "Горохов", "Камень-Каширский", "Киверцы", "Ковель", "Луцк", "Любомль", "Нововолынск", "Рожище", "Устилуг", "Апостолово", "Верхнеднепровск", "Вольногорск", "Днепродзержинск", "Днепропетровск", "Жёлтые Воды", "Кривой Рог", "Марганец", "Никополь", "Новомосковск", "Орджоникидзе", "Павлоград", "Перещепино", "Першотравенск", "Подгородное", "Пятихатки", "Синельниково", "Терновка", "Авдеевка", "Артёмовск", "Волноваха", "Горловка", "Дзержинск", "Дебальцево", "Димитров", "Доброполье", "Докучаевск", "Донецк", "Дружковка", "Енакиево", "Ждановка", "Зугрэс", "Кировское", "Краматорск", "Красноармейск", "Красный Лиман", "Константиновка", "Мариуполь", "Макеевка", "Новогродовка", "Селидово", "Славянск", "Снежное", "Соледар", "Торез", "Угледар", "Харцызск", "Шахтёрск", "Ясиноватая", "Андрушёвка", "Барановка", "Бердичев", "Житомир", "Коростень", "Коростышев", "Малин", "Новоград-Волынский", "Овруч", "Радомышль", "Берегово", "Виноградов", "Иршава", "Мукачево", "Перечин", "Рахов", "Свалява", "Тячев", "Ужгород", "Хуст", "Чоп", "Бердянск", "Васильевка", "Вольнянск", "Гуляйполе", "Днепрорудное", "Запорожье", "Каменка-Днепровская", "Мелитополь", "Молочанск", "Орехов", "Пологи", "Приморск", "Токмак", "Энергодар", "Болехов", "Бурштын", "Галич", "Городенка", "Долина", "Ивано-Франковск", "Калуш", "Коломыя", "Косов", "Надворная", "Рогатин", "Снятын", "Тысменица", "Тлумач", "Яремче", "Белая Церковь", "Березань", "Богуслав", "Борисполь", "Боярка", "Бровары", "Буча", "Васильков", "Вишнёвое", "Вышгород", "Ирпень", "Кагарлык", "Киев", "Мироновка", "Обухов", "Переяслав-Хмельницкий", "Припять", "Ржищев", "Сквира", "Славутич", "Тараща", "Тетиев", "Узин", "Украинка", "Фастов", "Чернобыль", "Яготин", "Кировоградская область", "Александрия", "Бобринец", "Гайворон", "Долинская", "Знаменка", "Кировоград", "Малая Виска", "Новомиргород", "Новоукраинка", "Светловодск", "Александровск", "Алмазная", "Алчевск", "Антрацит", "Брянка", "Вахрушево", "Горное", "Зимогорье", "Золотое", "Зоринск", "Краснодон", "Красный Луч", "Лисичанск", "Луганск", "Лутугино", "Миусинск", "Молодогвардейск", "Новодружеск", "Новопсков", "Первомайск", "Перевальск", "Петровское", "Попасная", "Приволье", "Ровеньки", "Рубежное", "Сватово", "Северодонецк", "Старобельск", "Стаханов", "Суходольск", "Счастье", "Теплогорск", "Червонопартизанск", "Белз", "Бобрка", "Борислав", "Броды", "Буск", "Великие Мосты", "Глиняны", "Городок", "Добромиль", "Дрогобыч", "Дубляны", "Жидачов", "Жолква", "Золочев", "Каменка-Бугская", "Львов", "Мостиска", "Перемышляны", "Пустомыты", "Рава-Русская", "Радехов", "Рудки", "Самбор", "Сколе", "Сокаль", "Старый Самбор", "Стрый", "Трускавец", "Угнев", "Хыров", "Червоноград", "Яворов", "Баштанка", "Вознесенск", "Николаев", "Новая Одесса", "Новый Буг", "Очаков", "Первомайск", "Снигирёвка", "Южноукраинск", "Ананьев", "Арциз", "Балта", "Белгород-Днестровский", "Болград", "Измаил", "Ильичёвск", "Килия", "Кодыма", "Котовск", "Одесса", "Татарбунары", "Теплодар", "Южное", "Гадяч", "Глобино", "Гребёнка", "Зеньков", "Карловка", "Кременчуг", "Кобеляки", "Комсомольск", "Лохвица", "Лубны", "Миргород", "Пирятин", "Полтава", "Хорол", "Червонозаводское", "Березне", "Дубно", "Дубровица", "Здолбунов", "Корец", "Костополь", "Кузнецовск", "Острог", "Радивилов", "Ровно", "Сарны", "Ахтырка", "Белополье", "Бурынь", "Глухов", "Кролевец", "Конотоп", "Лебедин", "Путивль", "Ромны", "Середина-Буда", "Сумы", "Тростянец", "Шостка", "Бережаны", "Борщёв", "Бучач", "Залещики", "Збараж", "Зборов", "Кременец", "Лановцы", "Монастыриска", "Подволочиск", "Подгайцы", "Почаев", "Скалат", "Тернополь", "Теребовля", "Чортков", "Шумск", "Балаклея", "Барвенково", "Богодухов", "Валки", "Великий Бурлук", "Волчанск", "Дергачи", "Змиев", "Изюм", "Красноград", "Купянск", "Лозовая", "Люботин", "Мерефа", "Первомайский", "Харьков", "Чугуев", "Берислав", "Геническ", "Голая Пристань", "Каховка", "Новая Каховка", "Скадовск", "Таврийск", "Херсон", "Цюрупинск", "Волочиск", "Городок", "Деражня", "Дунаевцы", "Изяслав", "Каменец-Подольский", "Красилов", "Нетешин", "Полонное", "Славута", "Староконстантинов", "Хмельницкий", "Шепетовка", "Ватутино", "Городище", "Жашков", "Звенигородка", "Золотоноша", "Каменка", "Канев", "Корсунь-Шевченковский", "Монастырище", "Смела", "Тальное","Умань", "Христиновка", "Черкассы", "Чигирин", "Шпола", "Бахмач", "Бобровица", "Борзна", "Десна", "Ичня", "Корюковка", "Мена", "Нежин", "Новгород-Северский", "Носовка", "Прилуки", "Седнев", "Семёновка", "Чернигов", "Щорс", "Вашковцы", "Вижница", "Герца", "Заставна", "Кицмань", "Новоднестровск", "Новоселица", "Сокиряны", "Сторожинец", "Хотин", "Черновцы"];


const autocomplete = (inp, arr) => {
    let currentFocus;
    inp.addEventListener("input", function (e) {
        let a, b, i, val = this.value;
        closeAllLists();
        if (!val) {
            return false;
        }
        currentFocus = -1;
        a = document.createElement("DIV");
        a.setAttribute("id", this.id + "autocomplete-list");
        a.setAttribute("class", "autocomplete-items");
        this.parentNode.appendChild(a);
        for (i = 0; i < arr.length; i++) {
            if (arr[i].substr(0, val.length).toUpperCase() == val.toUpperCase()) {
                b = document.createElement("DIV");
                b.innerHTML = "<strong>" + arr[i].substr(0, val.length) + "</strong>";
                b.innerHTML += arr[i].substr(val.length);
                b.innerHTML += "<input type='hidden' value='" + arr[i] + "'>";
                b.addEventListener("click", function (e) {
                    inp.value = this.getElementsByTagName("input")[0].value;
                    closeAllLists();
                });
                a.appendChild(b);
            }
        }
    });
    inp.addEventListener("keydown", function (e) {
        let x = document.getElementById(this.id + "autocomplete-list");
        if (x) x = x.getElementsByTagName("div");
        if (e.keyCode == 40) {
            currentFocus++;
            addActive(x);
        } else if (e.keyCode == 38) {
            currentFocus--;
            addActive(x);
        } else if (e.keyCode == 13) {
            e.preventDefault();
            if (currentFocus > -1) {
                if (x) x[currentFocus].click();
            }
        }
    });

    function addActive(x) {
        if (!x) return false;
        removeActive(x);
        if (currentFocus >= x.length) currentFocus = 0;
        if (currentFocus < 0) currentFocus = (x.length - 1);
        x[currentFocus].classList.add("autocomplete-active");
    }

    function removeActive(x) {
        for (let i = 0; i < x.length; i++) {
            x[i].classList.remove("autocomplete-active");
        }
    }

    function closeAllLists(el) {
        let x = document.getElementsByClassName("autocomplete-items");
        for (let i = 0; i < x.length; i++) {
            if (el != x[i] && el != inp) {
                x[i].parentNode.removeChild(x[i]);
            }
        }
    }

    document.addEventListener("click", function (e) {
        closeAllLists(e.target);
    });
}

autocomplete(document.getElementById("myInput"), ukCity);


